lightcalamar/STM32GENERIC_FT81x/STM32/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.serial=Serial communication
menu.subboard=Specific Board
menu.upload_method=Upload method
menu.usb=USB
menu.jtag_swd=JTAG/SWD debugging


################################################################################
# MapleMini_F103CB board

MapleMini_F103CB.name=MapleMini F103CB

MapleMini_F103CB.upload.protocol=nucleoFlasher
MapleMini_F103CB.upload.maximum_size=131072
MapleMini_F103CB.upload.maximum_data_size=20480
MapleMini_F103CB.upload.tool=maple_upload

MapleMini_F103CB.build.mcu=cortex-m3
MapleMini_F103CB.build.board=MAPLE_MINI
MapleMini_F103CB.build.core=arduino
MapleMini_F103CB.build.variant=MAPLE_MINI
MapleMini_F103CB.build.series=STM32F1
MapleMini_F103CB.build.extra_flags=-DSTM32F103CB
MapleMini_F103CB.build.f_cpu=72000000L

#---------------------------- UPLOAD METHODS ---------------------------

MapleMini_F103CB.menu.upload_method.DFUUploadMethod2=USB DFU - STM32duino bootloader (0x2000)
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.upload.protocol=maple_dfu
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.upload.tool=maple_upload
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000 -DUSB_DISC_PIN=PB9
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.build.ldscript=ldscript_bootloader_2000.ld
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.upload.usbID=1EAF:0003
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.upload.altID=2
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.flash.maximum_size=122880
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.maximum_data_size=122880
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.ram.maximum_size=20480
MapleMini_F103CB.menu.upload_method.DFUUploadMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini_F103CB.menu.upload_method.DFUUploadMethod1=USB DFU - Maple bootloader (original version) (0x5000)
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.upload.protocol=maple_dfu
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.upload.tool=maple_upload
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x5000 -DUSB_DISC_PIN=PB9
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.build.ldscript=ldscript_bootloader_5000.ld
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.upload.usbID=1EAF:0003
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.upload.altID=1
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.flash.maximum_size=110592
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.maximum_data_size=110592
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.ram.maximum_size=17408
MapleMini_F103CB.menu.upload_method.DFUUploadMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini_F103CB.menu.upload_method.STLinkMethod=STLink 
MapleMini_F103CB.menu.upload_method.STLinkMethod.upload.protocol=STLink
MapleMini_F103CB.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
MapleMini_F103CB.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

MapleMini_F103CB.menu.upload_method.serialMethod=Serial UART1 [TX/PA9/26, RX/PA10/25, BOOT1=0, BOOT0(button)=1(press when reset)]
MapleMini_F103CB.menu.upload_method.serialMethod.upload.protocol=maple_serial
MapleMini_F103CB.menu.upload_method.serialMethod.upload.tool=serial_upload
MapleMini_F103CB.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

MapleMini_F103CB.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
MapleMini_F103CB.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
MapleMini_F103CB.menu.upload_method.BMPMethod.upload.tool=bmp_upload

MapleMini_F103CB.menu.usb.SerialUSB=Serial [Virtual COM port, 24(PA11)/23(PA12) pins]
MapleMini_F103CB.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
MapleMini_F103CB.menu.usb.SerialMSC=Mass storage [testing, see documentation]
MapleMini_F103CB.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
MapleMini_F103CB.menu.usb.Disabled=Disabled, no USB

MapleMini_F103CB.menu.serial.Automatic=Automatically selected based on upload method
MapleMini_F103CB.menu.serial.SerialUSB=SerialUSB
MapleMini_F103CB.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
MapleMini_F103CB.menu.serial.SerialUART1=SerialUART1
MapleMini_F103CB.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

MapleMini_F103CB.menu.jtag_swd.Disabled=Disabled [debug pins free]
MapleMini_F103CB.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED
MapleMini_F103CB.menu.jtag_swd.SWD=SWD [debug pins reserved: 21(PA14), 22(PA13)]
MapleMini_F103CB.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
MapleMini_F103CB.menu.jtag_swd.JTAG=JTAG [debug pins reserved: 18(PB4), 19(PB3), 20(PA15), 21(PA14), 22(PA13)]
MapleMini_F103CB.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG

################################################################################
# BluePill board

BluePill.name=BluePill F103CB

BluePill.upload.protocol=nucleoFlasher
BluePill.upload.maximum_size=131072
BluePill.upload.maximum_data_size=20480
BluePill.upload.tool=maple_upload

BluePill.build.mcu=cortex-m3
BluePill.build.board=BLUEPILL
BluePill.build.core=arduino
BluePill.build.variant=BLUEPILL
BluePill.build.series=STM32F1
BluePill.build.extra_flags=-DSTM32F103CB
BluePill.build.f_cpu=72000000L

#---------------------------- UPLOAD METHODS ---------------------------

BluePill.menu.upload_method.DFUUploadMethod=USB DFU - STM32duino bootloader (0x2000)
BluePill.menu.upload_method.DFUUploadMethod.upload.protocol=maple_dfu
BluePill.menu.upload_method.DFUUploadMethod.upload.tool=maple_upload
BluePill.menu.upload_method.DFUUploadMethod.build.extra_flags=-DSTM32F103CB -DVECT_TAB_OFFSET=0x2000
BluePill.menu.upload_method.DFUUploadMethod.build.ldscript=ldscript_bootloader_2000.ld
BluePill.menu.upload_method.DFUUploadMethod.upload.usbID=1EAF:0003
BluePill.menu.upload_method.DFUUploadMethod.upload.altID=2
BluePill.menu.upload_method.DFUUploadMethod.flash.maximum_size=122880
BluePill.menu.upload_method.DFUUploadMethod.maximum_data_size=122880
BluePill.menu.upload_method.DFUUploadMethod.ram.maximum_size=20480
BluePill.menu.upload_method.DFUUploadMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

