lightcalamar/STM32GENERIC_FT81x/STM32/boards.txt
DISCOVERY_F429ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F429ZI.build.series=STM32F4
DISCOVERY_F429ZI.build.variant=DISCOVERY_F429ZI

DISCOVERY_F429ZI.build.extra_flags=-DSTM32F429ZI -DSTM32F429xx -DHSE_VALUE=8000000
# TODO f_cpu, and check SystemClock_Config() 
# DISCOVERY_F429ZI.build.f_cpu=168000000L

DISCOVERY_F429ZI.upload.protocol=STLink
DISCOVERY_F429ZI.upload.tool=stlink_upload

DISCOVERY_F429ZI.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F429ZI.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F429ZI.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F429ZI.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F429ZI.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F429ZI.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUART1=SerialUART1 [PA9/PA10]
DISCOVERY_F429ZI.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

################################################################################
# Discovery F746NG board

DISCOVERY_F746NG.name=Discovery F746NG

DISCOVERY_F746NG.upload.maximum_size=1048576
DISCOVERY_F746NG.upload.maximum_data_size=327680

DISCOVERY_F746NG.build.core=arduino
DISCOVERY_F746NG.build.board=DISCOVERY_F746NG

DISCOVERY_F746NG.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F746NG.build.series=STM32F7
DISCOVERY_F746NG.build.variant=DISCOVERY_F746NG
DISCOVERY_F746NG.build.extra_flags=-DSTM32F746NG -DDATA_IN_ExtSDRAM
DISCOVERY_F746NG.build.f_cpu=218000000L

DISCOVERY_F746NG.upload.protocol=STLink
DISCOVERY_F746NG.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.STLinkMethod=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.massstorage_drive=DIS_F746NG

DISCOVERY_F746NG.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
DISCOVERY_F746NG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F746NG.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F746NG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F746NG.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F746NG.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PA9]
DISCOVERY_F746NG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F746NG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F746NG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB



















################################################################################
# NUCLEO_F429ZI board

NUCLEO_F429ZI.name=Nucleo F429ZI

NUCLEO_F429ZI.vid.0=0x0483
NUCLEO_F429ZI.pid.0=0x5711
NUCLEO_F429ZI.node=NODE_F429ZI

NUCLEO_F429ZI.upload.tool=nucleoFlasher
NUCLEO_F429ZI.upload.protocol=nucleoFlasher
NUCLEO_F429ZI.upload.maximum_size=2097151
NUCLEO_F429ZI.upload.maximum_data_size=262144

NUCLEO_F429ZI.build.mcu=cortex-m4
NUCLEO_F429ZI.build.f_cpu=16000000L
NUCLEO_F429ZI.build.vid=0x0483
NUCLEO_F429ZI.build.pid=0x5711
NUCLEO_F429ZI.build.usb_product="NUCLEO-F429ZI"
NUCLEO_F429ZI.build.board=NUCLEO_F429ZI
NUCLEO_F429ZI.build.core=arduino
NUCLEO_F429ZI.build.ldscript=linker_scripts/gcc/STM32F429ZI_FLASH.ld
NUCLEO_F429ZI.build.variant=STM32F429ZI_Nucleo
NUCLEO_F429ZI.build.variant_system_lib=libstm32f4_nucleo_f429zi_gcc_rel.a
#To enable USB add '-DUSBCON'
#To enable HID (keyboard and mouse support) add also '-DUSBD_USE_HID_COMPOSITE'
NUCLEO_F429ZI.build.extra_flags=-mthumb -DSTM32F429xx {build.usb_flags}

NUCLEO_F429ZI.menu.upload_method.MassStorageMethod=Mass Storage
NUCLEO_F429ZI.menu.upload_method.MassStorageMethod.upload.protocol=
NUCLEO_F429ZI.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

NUCLEO_F429ZI.menu.upload_method.STLinkMethod=STLink
NUCLEO_F429ZI.menu.upload_method.STLinkMethod.upload.protocol=STLink
NUCLEO_F429ZI.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

################################################################################
# Black F407 board V2

BLACK_F407v2.name=Black F407v2

BLACK_F407v2.vid.0=0x0483
BLACK_F407v2.pid.0=0x5711
BLACK_F407v2.node=NODE_F407VE2

BLACK_F407v2.upload.tool=stlink_upload
BLACK_F407v2.upload.protocol=STLink
BLACK_F407v2.upload.maximum_size=524288
## was 2097151, 512k for now
BLACK_F407v2.upload.maximum_data_size=131072
# was 262144, 128k for now, maybe 196608???

BLACK_F407v2.build.mcu=cortex-m4
## fix clock tree and amend this
BLACK_F407v2.build.f_cpu=16800000L
BLACK_F407v2.build.vid=0x0483
BLACK_F407v2.build.pid=0x5711
BLACK_F407v2.build.usb_product="BLACK-F407V2"
BLACK_F407v2.build.board=BLACK_F407v2
BLACK_F407v2.build.core=arduino
BLACK_F407v2.build.ldscript=linker_scripts/gcc/STM32F407VE_FLASH.ld
BLACK_F407v2.build.variant=STM32F407_Black2
BLACK_F407v2.build.variant_system_lib=libstm32f4_BLACK_F407_gcc_rel.a
#To enable USB add '-DUSBCON'
#To enable HID (keyboard and mouse support) add also '-DUSBD_USE_HID_COMPOSITE'
BLACK_F407v2.build.extra_flags=-mthumb -DSTM32F407xx -DUSBCON {build.usb_flags}

BLACK_F407v2.menu.upload_method.STLinkMethod=STLink
BLACK_F407v2.menu.upload_method.STLinkMethod.upload.protocol=STLink
BLACK_F407v2.menu.upload_method.STLinkMethod.upload.tool=stlink_upload 

BLACK_F407v2.menu.upload_method.MassStorageMethod=Mass Storage
BLACK_F407v2.menu.upload_method.MassStorageMethod.upload.protocol=
BLACK_F407v2.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
################################################################################
# Black F407 board V1
BLACK_F407.name=Black F407

BLACK_F407.vid.0=0x0483
BLACK_F407.pid.0=0x5711
BLACK_F407.node=NODE_F407VE

BLACK_F407.upload.tool=stlink_upload
BLACK_F407.upload.protocol=STLink
BLACK_F407.upload.maximum_size=524288
## was 2097151, 512k for now
BLACK_F407.upload.maximum_data_size=131072
# was 262144, 128k for now, maybe 196608???

BLACK_F407.build.mcu=cortex-m4
## fix clock tree and amend this
BLACK_F407.build.f_cpu=16800000L
BLACK_F407.build.vid=0x0483
BLACK_F407.build.pid=0x5711
BLACK_F407.build.usb_product="BLACK-F407VE"
BLACK_F407.build.board=BLACK_F407
BLACK_F407.build.core=arduino
BLACK_F407.build.ldscript=linker_scripts/gcc/STM32F407VE_FLASH.ld
BLACK_F407.build.variant=STM32F407_Black
BLACK_F407.build.variant_system_lib=libstm32f4_BLACK_F407_gcc_rel.a
#To enable USB add '-DUSBCON'
#To enable HID (keyboard and mouse support) add also '-DUSBD_USE_HID_COMPOSITE'
BLACK_F407.build.extra_flags=-mthumb -DSTM32F407xx {build.usb_flags}

